[M_IrisHUB_MatterOfTaste MissionDefinition]
MissionDescription="Some wannabe critics in [place]Southern Raceway[-place] negatively reviewed some of Mister Torgue's favorite ECHO simulation games. In a haze of illogical fury, he ordered you to head to [place]Southern Raceway[-place] and kill the reviewers on his behalf."
TurnInDescription="In Mister Torgue's defense, ''Diamond Mercenaries 2'' is criminally underrated."
MissionSummary="Kill ECHOnet Reviewers for Mister Torgue"

[M_IrisHUB_MatterOfTaste:DefeatOtherReviewer MissionObjectiveDefinition]
ProgressMessage="Kill game critic"

[M_IrisHUB_MatterOfTaste:DefeatWave2 MissionObjectiveDefinition]
ProgressMessage="Murder every last ECHOnet reviewer"

[M_IrisHUB_MatterOfTaste:FindReviewer MissionObjectiveDefinition]
ProgressMessage="Find BuffGamer"

[M_IrisHUB_MatterOfTaste:KillReviewer MissionObjectiveDefinition]
ProgressMessage="Kill BuffGamer"
